# Indexing and selecting data

http://pandas.pydata.org/pandas-docs/stable/indexing.html

In [61]:
# Import stuff
# Create sample data frame from old MTH 225 gradebook
# (Student last names redacted to first two letters for privacy)

import numpy as np
import pandas as pd

# index_col = 0 forces the leftmost column to be the index
# Otherwise the index is 0,1,2,...
grades = pd.read_csv('225-gradebook.csv', index_col=0)

grades.head()

    hw_pass  hw_e  lt_pass  lt_e  pp_pass  pp_e  gp
Am        5     3       27    17        5     5  26
Bl        2     1       21    12        3     3  18
Br        4     2       26    17        4     4  28
Co        4     2       21    14        0     0  24
Cr        4     1       23    17        3     3  20

## Different ways to index and select

Using `.loc`:

- Single label (`df.loc['Label']`)
- List or array of labels (`df.loc[['a','b','c']]`)
- Slice object (`df.loc['a':'f']` -- note both beginning and end are included unlike usual slicing) (BUT see below)
- Boolean array (`df.loc[True, True, False]`)
- Callable function

In [62]:
grades.loc['Dy']

hw_pass     0
hw_e        0
lt_pass    11
lt_e        4
pp_pass     1
pp_e        0
gp         21
Name: Dy, dtype: int64

In [57]:
grades.loc[['Dy', 'Ya']]

    hw_pass  hw_e  lt_pass  lt_e  pp_pass  pp_e  gp
Dy        0     0       11     4        1     0  21
Ya        5     4       27    21        5     5  25

In [58]:
grades.loc['Fl':'Va']

    hw_pass  hw_e  lt_pass  lt_e  pp_pass  pp_e  gp
Fl        5     4       28    24        5     5  24
Fr        0     0        2     2        0     0   9
Ga        5     3       25    17        5     5  22
He        4     3       23    17        3     3  24
Li        5     4       26    17        5     5  19
Mc        0     0        9     1        2     2  22
Ma        5     2       24    11        5     5  23
Ng        4     2       23    16        3     3  19
Sc        5     3       24    19        4     4  26
Sh        4     4       23    15        2     1  25
St        0     0        2     0        0     0  17
Va        3     1       13     4        0     0  20

In [59]:
# Boolean array

# All students with fewer than 3 E's on homework 
grades.loc[grades.hw_e < 3]

    hw_pass  hw_e  lt_pass  lt_e  pp_pass  pp_e  gp
Bl        2     1       21    12        3     3  18
Br        4     2       26    17        4     4  28
Co        4     2       21    14        0     0  24
Cr        4     1       23    17        3     3  20
Di        4     2       26    20        3     3  28
Dy        0     0       11     4        1     0  21
Fr        0     0        2     2        0     0   9
Mc        0     0        9     1        2     2  22
Ma        5     2       24    11        5     5  23
Ng        4     2       23    16        3     3  19
St        0     0        2     0        0     0  17
Va        3     1       13     4        0     0  20
Zi        1     0       23    11        3     3  22

In [60]:
grades[grades.gp == 20]  # Exactly 20 points on Guided Practice

    hw_pass  hw_e  lt_pass  lt_e  pp_pass  pp_e  gp
Cr        4     1       23    17        3     3  20
Va        3     1       13     4        0     0  20

Using `.iloc`: 

- Single integer
- List or array of integers
- Slice object with ints
- Boolean array
- Callable function

In [52]:
grades.iloc[10]

hw_pass     5
hw_e        3
lt_pass    25
lt_e       17
pp_pass     5
pp_e        5
gp         22
Name: Garza, dtype: int64

In [53]:
grades.iloc[10:20]

             hw_pass  hw_e  lt_pass  lt_e  pp_pass  pp_e  gp
Garza              5     3       25    17        5     5  22
Helme              4     3       23    17        3     3  24
Lindenbaum         5     4       26    17        5     5  19
MacDonald          0     0        9     1        2     2  22
Malaric            5     2       24    11        5     5  23
Nguyen             4     2       23    16        3     3  19
Schindler          5     3       24    19        4     4  26
Shoup              4     4       23    15        2     1  25
Stewart            0     0        2     0        0     0  17
VanHeukelum        3     1       13     4        0     0  20

## Basics

In [64]:
dates = pd.date_range('1/1/2017', periods = 10)
df = pd.DataFrame(np.random.randn(10,4), index = dates, columns = ['A', 'B', 'C', 'D'])

df

                   A         B         C         D
2017-01-01  0.204544 -0.756704  0.422388  0.043980
2017-01-02 -0.624402  0.229541 -0.340221  0.273424
2017-01-03  1.066400 -0.550913  0.910201 -0.125080
2017-01-04  0.161492 -0.156575  1.305912  0.766913
2017-01-05  0.718496  1.876607  1.628953 -0.616447
2017-01-06  1.773442 -1.300232 -1.082366 -0.743355
2017-01-07 -1.576227 -1.214207 -1.233188 -0.730616
2017-01-08 -1.155871 -1.200027 -0.395216 -0.537897
2017-01-09  0.258590 -0.051296 -0.113507  1.510167
2017-01-10 -0.417995  1.128834  0.220435 -1.123718

In [66]:
# Just giving a name slices out the column
df['A']

2017-01-01    0.204544
2017-01-02   -0.624402
2017-01-03    1.066400
2017-01-04    0.161492
2017-01-05    0.718496
2017-01-06    1.773442
2017-01-07   -1.576227
2017-01-08   -1.155871
2017-01-09    0.258590
2017-01-10   -0.417995
Freq: D, Name: A, dtype: float64

In [68]:
# Item in position 5 of column A
df['A'][5]

1.7734415256731042

In [69]:
# Can also pass a list of columns -- still not using .loc

df[['B', 'D']]

                   B         D
2017-01-01 -0.756704  0.043980
2017-01-02  0.229541  0.273424
2017-01-03 -0.550913 -0.125080
2017-01-04 -0.156575  0.766913
2017-01-05  1.876607 -0.616447
2017-01-06 -1.300232 -0.743355
2017-01-07 -1.214207 -0.730616
2017-01-08 -1.200027 -0.537897
2017-01-09 -0.051296  1.510167
2017-01-10  1.128834 -1.123718

## Attribute access

In [71]:
# Can get indices directly as attributes: 

print(grades.hw_pass)
print(df.B)

Am    5
Bl    2
Br    4
Co    4
Cr    4
Di    4
Du    4
Dy    0
Fl    5
Fr    0
Ga    5
He    4
Li    5
Mc    0
Ma    5
Ng    4
Sc    5
Sh    4
St    0
Va    3
Ve    4
Wa    5
Ya    5
Zi    1
Name: hw_pass, dtype: int64
2017-01-01   -0.756704
2017-01-02    0.229541
2017-01-03   -0.550913
2017-01-04   -0.156575
2017-01-05    1.876607
2017-01-06   -1.300232
2017-01-07   -1.214207
2017-01-08   -1.200027
2017-01-09   -0.051296
2017-01-10    1.128834
Freq: D, Name: B, dtype: float64

In [73]:
# Can also set values this way:
df.B[1] = 3.14159
df.B

2017-01-01   -0.756704
2017-01-02    3.141590
2017-01-03   -0.550913
2017-01-04   -0.156575
2017-01-05    1.876607
2017-01-06   -1.300232
2017-01-07   -1.214207
2017-01-08   -1.200027
2017-01-09   -0.051296
2017-01-10    1.128834
Freq: D, Name: B, dtype: float64

In [75]:
# Or add a row to a data frame by giving a dictionary

df.iloc[1] = dict(A = 1, B = 2, C = 3, D = 99)
df

                   A         B         C          D
2017-01-01  0.204544 -0.756704  0.422388   0.043980
2017-01-02  1.000000  2.000000  3.000000  99.000000
2017-01-03  1.066400 -0.550913  0.910201  -0.125080
2017-01-04  0.161492 -0.156575  1.305912   0.766913
2017-01-05  0.718496  1.876607  1.628953  -0.616447
2017-01-06  1.773442 -1.300232 -1.082366  -0.743355
2017-01-07 -1.576227 -1.214207 -1.233188  -0.730616
2017-01-08 -1.155871 -1.200027 -0.395216  -0.537897
2017-01-09  0.258590 -0.051296 -0.113507   1.510167
2017-01-10 -0.417995  1.128834  0.220435  -1.123718

## Slicing ranges

In a DataFrame, slicing inside `[]` slices __rows__ --- even though putting in just a single value without slicing would give columns.

In [79]:
grades[:3]

# Note `grades[3]` throws an error

    hw_pass  hw_e  lt_pass  lt_e  pp_pass  pp_e  gp
Am        5     3       27    17        5     5  26
Bl        2     1       21    12        3     3  18
Br        4     2       26    17        4     4  28

In [77]:
grades[10:20]

    hw_pass  hw_e  lt_pass  lt_e  pp_pass  pp_e  gp
Ga        5     3       25    17        5     5  22
He        4     3       23    17        3     3  24
Li        5     4       26    17        5     5  19
Mc        0     0        9     1        2     2  22
Ma        5     2       24    11        5     5  23
Ng        4     2       23    16        3     3  19
Sc        5     3       24    19        4     4  26
Sh        4     4       23    15        2     1  25
St        0     0        2     0        0     0  17
Va        3     1       13     4        0     0  20

So basically this is an abbreviation for `.iloc`

`df[a:b] == df.iloc[a:b]`

## Selection by label

Literally "label" = the row label. Mostly this is done with `.loc` and `.iloc`

In [80]:
grades.loc['Ng']

hw_pass     4
hw_e        2
lt_pass    23
lt_e       16
pp_pass     3
pp_e        3
gp         19
Name: Ng, dtype: int64

In [81]:
grades.loc['Ng':'St']

    hw_pass  hw_e  lt_pass  lt_e  pp_pass  pp_e  gp
Ng        4     2       23    16        3     3  19
Sc        5     3       24    19        4     4  26
Sh        4     4       23    15        2     1  25
St        0     0        2     0        0     0  17

In [96]:
grades.loc[:'St']

    hw_pass  hw_e  lt_pass  lt_e  pp_pass  pp_e  gp
Am        5     3       27    17        5     5  26
Bl        2     1       21    12        3     3  18
Br        4     2       26    17        4     4  28
Co        4     2       21    14        0     0  24
Cr        4     1       23    17        3     3  20
Di        4     2       26    20        3     3  28
Du        4     3       22    15        4     4  22
Dy        0     0       11     4        1     0  21
Fl        5     4       28    24        5     5  24
Fr        0     0        2     2        0     0   9
Ga        5     3       25    17        5     5  22
He        4     3       23    17        3     3  24
Li        5     4       26    17        5     5  19
Mc        0     0        9     1        2     2  22
Ma        5     2       24    11        5     5  23
Ng        4     2       23    16        3     3  19
Sc        5     3       24    19        4     4  26
Sh        4     4       23    15        2     1  25
St        0     0        2     0        0     0  17

In [97]:
# Can also set 

grades2 = grades.copy()
grades2.loc['St']['gp'] = 999
grades2[15:]

    hw_pass  hw_e  lt_pass  lt_e  pp_pass  pp_e   gp
Ng        4     2       23    16        3     3   19
Sc        5     3       24    19        4     4   26
Sh        4     4       23    15        2     1   25
St        0     0        2     0        0     0  999
Va        3     1       13     4        0     0   20
Ve        4     3       25    22        3     3   25
Wa        5     4       25    22        5     4   25
Ya        5     4       27    21        5     5   25
Zi        1     0       23    11        3     3   22

In [107]:
# Using a list
# First list is from the index
# Second list if from the column labels

grades.loc[['Ng', 'Ve', 'Ya'], 'hw_pass':'lt_e']

    hw_pass  hw_e  lt_pass  lt_e
Ng        4     2       23    16
Ve        4     3       25    22
Ya        5     4       27    21

In [110]:
# Slices in both directions

grades.loc['Ng':, 'hw_e':]

    hw_e  lt_pass  lt_e  pp_pass  pp_e  gp
Ng     2       23    16        3     3  19
Sc     3       24    19        4     4  26
Sh     4       23    15        2     1  25
St     0        2     0        0     0  17
Va     1       13     4        0     0  20
Ve     3       25    22        3     3  25
Wa     4       25    22        5     4  25
Ya     4       27    21        5     5  25
Zi     0       23    11        3     3  22

In [112]:
# With a boolean array

# Gives all the COLUMNS in which student Ng scored more than 20 
grades.loc['Ng'] > 20

hw_pass    False
hw_e       False
lt_pass     True
lt_e       False
pp_pass    False
pp_e       False
gp         False
Name: Ng, dtype: bool

In [114]:
# Gives all the ROWS in which the value in column gp is greater than 20
# **** .loc always gives rows ****
grades['gp'] > 20

Am     True
Bl    False
Br     True
Co     True
Cr    False
Di     True
Du     True
Dy     True
Fl     True
Fr    False
Ga     True
He     True
Li    False
Mc     True
Ma     True
Ng    False
Sc     True
Sh     True
St    False
Va    False
Ve     True
Wa     True
Ya     True
Zi     True
Name: gp, dtype: bool

In [118]:
# Summary stats for each graded item, for students with GP scores higher than 20

grades[grades['gp'] > 20].describe()

,hw_pass,hw_e,lt_pass,lt_e,pp_pass,pp_e,gp
count,17.000000,17.000000,17.000000,17.000000,17.000000,17.000000,17.000000
mean,3.764706,2.470588,22.882353,15.705882,3.470588,3.294118,24.235294
std,1.714986,1.374666,5.206755,6.192381,1.545867,1.686887,2.077541
min,0.000000,0.000000,9.000000,1.000000,0.000000,0.000000,21.000000
25%,4.000000,2.000000,23.000000,14.000000,3.000000,3.000000,22.000000
50%,4.000000,3.000000,24.000000,17.000000,4.000000,4.000000,24.000000
75%,5.000000,3.000000,26.000000,20.000000,5.000000,5.000000,25.000000
max,5.000000,4.000000,28.000000,24.000000,5.000000,5.000000,28.000000

In [123]:
# Compare average number of homeworks passed for students whose Guided Practice scores are above
# 20, with those whose Guided Practice scores are below 20

print(grades[grades['gp'] > 20].mean()['hw_pass'])
print(grades[grades['gp'] < 20].mean()['hw_pass'])

3.76470588235
2.2

In [124]:
# Getting a specific value:

grades.loc['Ng', 'gp']

19

## Selection by position 

This is what `.iloc` is for.

In [125]:
grades.iloc[10:15]

    hw_pass  hw_e  lt_pass  lt_e  pp_pass  pp_e  gp
Ga        5     3       25    17        5     5  22
He        4     3       23    17        3     3  24
Li        5     4       26    17        5     5  19
Mc        0     0        9     1        2     2  22
Ma        5     2       24    11        5     5  23

In [126]:
grades.iloc[1:5, 2:4]

    lt_pass  lt_e
Bl       21    12
Br       26    17
Co       21    14
Cr       23    17

In [127]:
grades.iloc[[0,10,20], 3:]

    lt_e  pp_pass  pp_e  gp
Am    17        5     5  26
Ga    17        5     5  22
Ve    22        3     3  25

In [129]:
# Cross section of a single student 
grades.iloc[1]

hw_pass     2
hw_e        1
lt_pass    21
lt_e       12
pp_pass     3
pp_e        3
gp         18
Name: Bl, dtype: int64

## Selection by callable

You can pass a lambda to a data frame just like you can anything else.

In [130]:
# This is just a toy example
# It does the same thing as `grades[grades.gp > 20]`
grades[lambda grades: grades.gp > 20]

    hw_pass  hw_e  lt_pass  lt_e  pp_pass  pp_e  gp
Am        5     3       27    17        5     5  26
Br        4     2       26    17        4     4  28
Co        4     2       21    14        0     0  24
Di        4     2       26    20        3     3  28
Du        4     3       22    15        4     4  22
Dy        0     0       11     4        1     0  21
Fl        5     4       28    24        5     5  24
Ga        5     3       25    17        5     5  22
He        4     3       23    17        3     3  24
Mc        0     0        9     1        2     2  22
Ma        5     2       24    11        5     5  23
Sc        5     3       24    19        4     4  26
Sh        4     4       23    15        2     1  25
Ve        4     3       25    22        3     3  25
Wa        5     4       25    22        5     4  25
Ya        5     4       27    21        5     5  25
Zi        1     0       23    11        3     3  22

In [136]:
# Return data for students whose "E" scores total up to more than 10

grades[lambda grades: grades.hw_e + grades.lt_e > 10]

    hw_pass  hw_e  lt_pass  lt_e  pp_pass  pp_e  gp
Am        5     3       27    17        5     5  26
Bl        2     1       21    12        3     3  18
Br        4     2       26    17        4     4  28
Co        4     2       21    14        0     0  24
Cr        4     1       23    17        3     3  20
Di        4     2       26    20        3     3  28
Du        4     3       22    15        4     4  22
Fl        5     4       28    24        5     5  24
Ga        5     3       25    17        5     5  22
He        4     3       23    17        3     3  24
Li        5     4       26    17        5     5  19
Ma        5     2       24    11        5     5  23
Ng        4     2       23    16        3     3  19
Sc        5     3       24    19        4     4  26
Sh        4     4       23    15        2     1  25
Ve        4     3       25    22        3     3  25
Wa        5     4       25    22        5     4  25
Ya        5     4       27    21        5     5  25
Zi        1     0       23    11        3     3  22

In [137]:
grades[grades.hw_e + grades.lt_e > 10]

    hw_pass  hw_e  lt_pass  lt_e  pp_pass  pp_e  gp
Am        5     3       27    17        5     5  26
Bl        2     1       21    12        3     3  18
Br        4     2       26    17        4     4  28
Co        4     2       21    14        0     0  24
Cr        4     1       23    17        3     3  20
Di        4     2       26    20        3     3  28
Du        4     3       22    15        4     4  22
Fl        5     4       28    24        5     5  24
Ga        5     3       25    17        5     5  22
He        4     3       23    17        3     3  24
Li        5     4       26    17        5     5  19
Ma        5     2       24    11        5     5  23
Ng        4     2       23    16        3     3  19
Sc        5     3       24    19        4     4  26
Sh        4     4       23    15        2     1  25
Ve        4     3       25    22        3     3  25
Wa        5     4       25    22        5     4  25
Ya        5     4       27    21        5     5  25
Zi        1     0       23    11        3     3  22

## Selecting random samples 

Use the `.sample()` method on Series or DataFrames. It samples rows by default.

In [162]:
# Basically this just randomly selects a row
print(grades.sample())

# This randomly selects 5 rows 
print(grades.sample(n=5))

# This randomly samples 1/10 of the data
print(grades.sample(frac=0.10))

# This samples with replacement
print(grades.sample(n = 10, replace=True))

    hw_pass  hw_e  lt_pass  lt_e  pp_pass  pp_e  gp
Du        4     3       22    15        4     4  22
    hw_pass  hw_e  lt_pass  lt_e  pp_pass  pp_e  gp
Di        4     2       26    20        3     3  28
Ve        4     3       25    22        3     3  25
Fr        0     0        2     2        0     0   9
He        4     3       23    17        3     3  24
Ya        5     4       27    21        5     5  25
    hw_pass  hw_e  lt_pass  lt_e  pp_pass  pp_e  gp
Du        4     3       22    15        4     4  22
Cr        4     1       23    17        3     3  20
    hw_pass  hw_e  lt_pass  lt_e  pp_pass  pp_e  gp
Zi        1     0       23    11        3     3  22
Br        4     2       26    17        4     4  28
Ma        5     2       24    11        5     5  23
Fl        5     4       28    24        5     5  24
Li        5     4       26    17        5     5  19
St        0     0        2     0        0     0  17
Va        3     1       13     4        0     0  20
Ga        5     3       25    17        5     5  22
Zi        1     0       23    11        3     3  22
Du        4     3       22    15        4     4  22

In [163]:
# Sample columns = change axis 

grades.sample(n=2, axis = 1)

    hw_e  lt_e
Am     3    17
Bl     1    12
Br     2    17
Co     2    14
Cr     1    17
Di     2    20
Du     3    15
Dy     0     4
Fl     4    24
Fr     0     2
Ga     3    17
He     3    17
Li     4    17
Mc     0     1
Ma     2    11
Ng     2    16
Sc     3    19
Sh     4    15
St     0     0
Va     1     4
Ve     3    22
Wa     4    22
Ya     4    21
Zi     0    11

## Boolean indexing

## Indexing with `isin`

## The `where` method and masking

## Duplicate data

## Index objects

## Set/reset index